<template>
  <div>

  </div>
</template>

<script>

  // todo запрашиваем все корпуса когда игроку выбирает то появляется окошко характиристик и рисует доступные слоты

  // todo
  //   - меню батл рояля, игрок должен выбрать корпус и нажать кнопку старт
  //   - на бекенд отсылается сообщение о том что игрок начал режим батл рояля, и его телепортирует на нужну карту ставя при этому флаг
  //   - из баттл рояля игрок может ливнуть по нажатию кнопки выход и он попадает снова на гейт
  //   - игроки которые умерли/победил попадают на страницу статистики от туда в гейт в гейте снимается флаг батла
  //   - если в течение 30 сек ненайдены апоненты то на карту дропаются боты c ИИ защитника (но потом надо расширить на лутание)
  //   - на карте валяются орудия с 1 магазином, патроны, снаряжение, топливо, чертежи строений и хилки
  //   - для строительства строений не нужны ресурсы
  //   - ящики при столкновение умерают а содержимое сразу попадает в трюм, если это оружие то в слот оружия, если патроны то в оружие если подходит и тд
  //   - одновременно на транспорте может быть только 2 оружия, 1 на машине, другов в трюме.
  //   - на панеле снаряжения перед началом боя резервируются ячейки под оружие и снаряжения
  //   - оружие/снаряга которое поднялось и не смогло установится т.к. занято место попадают на панель быстрого доступа что бы их можно было экипировать
  //   - количествоя ячеек для хлама = 12 - количество ячеек снаряжения
  //   - на ящики накладывается спрайт то чего там лежит (или при наведение мышки)
  //   - доступно меню панель снаряжения/мини карта/статус и чат
  //   - при появление корпус игрока имеет 50% топляка во всех ячейках
  //   - одноверменно игрок может быть только в 1 бое, но если он умер или вышел то это уже не его бой

  export default {
    name: "BattleRoyale",
  }
</script>

<style scoped>

</style>
