<template>
  <div class="content_section">
    <h2 class="head">База</h2>
    <div class="content_section">

      <h3 class="headSection" id="base">База</h3>
      <p>База - центральный технический узел сектора.
        Фракция владеющая базой владеет всей инфраструктурой сектора.
        На базах можно производить различное оборудование, оружие, корпуса и тд.
        Базы могут выдавать различные задания. На базах можно торговать, так же база позволяет хранить имущество на
        своем складе.
        Пока игроки находятся на базе им ничего не угрожает, но на вражеской и нерабочей базе доступен только склад и
        ангар с ограниченными возможностями.</p>
      <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('base_1', 'png')+ ')',
        width: '600px',
        height: '200px',
        marginLeft: 'calc(50% - 300px)',
        }"/>

      <p>Перерабатывающий завод - сооружения которое позволяет перерабатывать полезные ископаемые в сырье для
        производства. Помимо переработки позволяет так же разбирать различие предметы на состовляющие компоненты.
        Перерабатывающий завод, взымает за свои услуги налог. Так же предоставляет склад и рынок.</p>
      <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('base_2', 'png')+ ')',
        width: '200px',
        height: '200px',
        marginLeft: 'calc(50% - 100px)',
        }"/>

      <p>Завод полуфабрикатов - сооружения которое позволяет создавать детали из сырья за 2х кратный налог на
        компоненты. Так же предоставляет склад и рынок.</p>
      <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('base_3', 'png')+ ')',
        width: '200px',
        height: '200px',
        marginLeft: 'calc(50% - 100px)',
        }"/>
    </div>
  </div>
</template>

<script>
export default {
  name: "Base"
}
</script>

<style scoped>

</style>
