<template>
  <div class="content_section">
    <h2 class="head" id="bodies">Корпуса</h2>
    <p>Корпус - основа транспорта, он определяет ходовые/защитные характиристики транспорта, кол-во слотов под
      снаряжения и размер оружия. </p>
    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('bodies_1', 'png')+ ')',
        width: '230px',
        height: '170px',
        marginLeft: 'calc(50% - 115px)',
        }"/>

    <p>Корпуса делятся на 3 стандарта характеризующих размеры, а так же на фракции - это определяет какие навыки
      необходимы для владения тем или иным корпусом. Если игрок использует корпус который ему не подходит по навыкам
      то корпус едет медленнее, скорость не постоянная, повороты корпуса происходят рывками.</p>

    <p>Навык брони корпуса повышается когда вы получаете урон, а навые движения повышается за движение на этом корпусе.</p>

    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('wiki_body_1', 'png')+ ')',
        width: '740px',
        height: '195px',
        marginLeft: 'calc(50% - 370px)',
        }"/>

    <div class="content_section">
      <h3 class="headSection">Характиристики: </h3>

      <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('wiki_body_2', 'png')+ ')',
        width: '369px',
        height: '334px',
        float: 'right',
        marginLeft: '10px',
        }"/>

      <p>Корпус определяет такие характиристики: </p>
      <ul>
        <li><span class="headSection">Объем трюма</span> - определяет сколько местра в трюме.</li>
        <li><span class="headSection">Макс. скорость</span> - максимальная скорость которую может развить корпус.
        </li>
        <li><span class="headSection">Разгон</span> - указывает как быстро будет набирать скорость корпус.</li>
        <li><span class="headSection">Скорость поворота</span> - поворот корпуса градусы/сек.</li>
        <li><span class="headSection">Дальность обзора</span> - как далеко можеть видеть в тумане войны.</li>
        <li><span class="headSection">Дальность радара</span> - определяет на каком растояние радар будет улавливать
          сигналы.
        </li>
        <li><span class="headSection">Структура</span> - кол-во хп корпуса.</li>
        <li><span class="headSection">Броня</span> - блокирует входящий урон в % соотношение.</li>
        <li><span class="headSection">Уязвимости</span> - указывает к каким типам атаки корпус уязвим, если корпус
          уязвим к кинетическим атакам на
          10% то он будет получать на 10% больше урона.
        </li>
        <li><span class="headSection">Вместимость аккамулятора</span> - максимальное количество энергии в накопителе
          для использования снаряжения.
          Так этот параметр указывает сколько снаряжения и оружия может использовать корпус.
        </li>
      </ul>

      <p>Параметры в ангаре могут отличатся в ангаре из за навыков и установленного снаряжения</p>

    </div>

    <div class="content_section">
      <h3 class="headSection">Топливо: </h3>

      <div class="detailImg" :style="{
          backgroundImage: 'url(' + $parent.getUrlImg('transport_2', 'png')+ ')',
          width: '230px',
          height: '170px',
          float: 'left',
          marginRight: '10px',
        }"/>

      <p>Для передвижения и подзарядке аккумуляторов транспорту необходимо иметь топиво. В роли топлива выступает
        обогащенный торий.</p>
      <p>Корпуса могут иметь от 1 до 3х ячеек топлива, если не все ячейки заполнены это будет влиять на ходовые
        характиристики транспорта. Если у транспорта 3 ячейки а заполнена только 2, то он будет медлее на передвигатся
        и поворачиватся на 33%, если из 3х заполнена только 1 то медлее на 66%.</p>
      <p>Если у корпуса полностью кончилось топливо он будет передвигатся со скорость 10% от масимальной, а накопитель
        перестанет заряжатся и использовать снаряжение не выйдет.</p>

      <p>Каждая ячейка транспорта имеет свой обьем и мощьность, например в ячейку можно положить 200 тория и эта
        ячейка может перерабаывать до 2х едениц тория в секунду. Это означает что при недостатки энергии в накопителе
        он будет пополнятся со скоростью 2 ед в секунду.</p>

      <p>Торий перерабатывается не сразу, у него есть определенное кол-во циклов, показано желтой шкалой на панеле
        реактора.</p>
    </div>

    <div class="content_section">

      <div class="detailImg" :style="{
          backgroundImage: 'url(' + $parent.getUrlImg('wiki_body_3', 'png')+ ')',
          width: '368px',
          height: '325px',
          float: 'right',
          marginLeft: '10px',
        }"/>

      <h3 class="headSection">Ячейки для снаряжения и оружия: </h3>
      <p>Корпуса могут иметь только 1 ячейку для оружия, и туда можно поставить только тот размер оружия который
        поддерживает корпус. Некоторые корпуса могут и не иметь оружия вовсе.</p>
      <p>Каждый корпус имеет различие конфигурации для снаряжения, всего существует 3 типа снаряжения
        определяющее его мощьность, они устанавливаются в соответствующие ячейки (I, II, III).</p>

      <p>Инофмарция по оснащению корпуса можно узнать на карточке итема ---></p>


    </div>

    <div class="content_section">
      <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('wiki_body_4', 'png')+ ')',
        width: '174px',
        height: '160px',
        float: 'right',
        marginLeft: '10px',
        }"/>

      <p>Некоторое снаряжение требует что бы ячейка для снаряжения была снаружи корпуса, например под модуль
        строительства, промышленый лазер или дрона, такие ячейки помечаются желтым цвестом в ангаре. В них попрежнему
        можно установить внутрее снаряжение.</p>
    </div>

    <div class="content_section">
      <h3 class="headSection">Бонусы: </h3>
      <p>Некоторые корпуса могут иметь профильные особенности, но что бы их использовать надо обладать подходящим
        навыком владения этим корпусом. Эти особености могут влиять почти на все аспекты от размера трюма, скорости и
        урона оружием.</p>

      <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('skills_3', 'png')+ ')',
            width: '717px',
            height: '572px',
            marginLeft: 'calc(50% - 358px)',
            }"/>
    </div>
  </div>
</template>

<script>
export default {
  name: "Bodies"
}
</script>

<style scoped>

</style>
