<template>
  <div class="content_section">
    <h2 class="head">Экспедиции</h2>

    <p>Экспедиция это хорошо организованая группа ботов которая отправляется из столицы в свободные земли.</p>
    <p>Задача экспедиции закрепится в свободном секторе, развернуть базу и добывать ресурсы. Каждая фракция посылает 1
      экпедицию в свободные земли, игроки другой фракции воспринимаются экспедицией как враги, а игроки своей фракции
      нейтральны если игрок не пытаются их атаковать.</p>

    <h3 class="headSection">Экспедиция дает членам своей фракции:</h3>
    <ul>
      <li>Защиту от APD, преступников и других фракций в свободных землях.</li>
      <li>Место где можно расположить свои склады и ящики.</li>
      <li>Переодлично из сектора уходят транспорты с ресурсами и охраной, это позволит легче вернутся в безопасную зону.
      </li>
    </ul>

    <p>Члены других фракций при достаточной силе отряда могут уничтожить аванпост фракции и ограбить склад, забрав от
      туда все ресурсы которые накопали боты и не успели вывезти.</p>

    <p>Если бы вы могли состоять в отряде эцспедиции то она бы выглядила как то так, но вы не можете С:</p>
    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('expedirion', 'png')+ ')',
        width: '1000px',
        height: '506px',
        marginLeft: 'calc(50% - 500px)',
        }"/>

    <div class="content_section">
      <h3 class="headSection">Жизненный цикл экспедиции: </h3>
      <ol>
        <li>У столицы появляется стартовый отряд из бойцов, строителей и транспорта забитый торием.</li>
        <li>Стартовый отряд следует в свободный сектор. Уничтожают всех врагов которых встретят по пути.</li>
        <li>В свободном сектора - зачищают зону установки лагеря. Строили начинают строить строения.</li>
        <li>Когда установлен склад из столицы идет подкрепление состоящие из бойцов и майнеров.</li>
        <li>При заполнение склада 50%++ из столицы выходит 3тий отряд который отвечает за перевозку ресурсов из склада
          до столицы. Состоит из бойцов и транспорта.
        </li>
      </ol>

      <p>Особености:</p>
      <ul>
        <li>Каждые 5 минут при условии что на аванпост не надпают из столицы приходит подкрепление состоящие из
          потеряных ботов во время боя.
        </li>
        <li>На аванпосте есть ремонтная станция которая чинит защитников а так же союзных игроков.</li>
        <li>Если вы установите свое строение его заправит транспорт аванпоста, при условии что он жив.</li>
        <li>Если склад аванпоста переполнен то майнеры могут класть накопаные ресурсы в строения игроков.</li>
        <li>Защитники преследуют врага до тех пор пока он не умрет или полностью не пропадет с радаров.</li>
        <li>После уничтожения аванпоста, склад становится доступен всем игрокам при условии что он остался жив.</li>
        <li>Отряд аванпоста забывает своих врагов через 3 минуты, если вы случайно спровоцировали их на себя, убегите и
          подождите 3 минуты.
        </li>
      </ul>

      <p>Экспедиция считается уничтоженой когда уничтожены все боты в секторе аванпоста. После этого подкрепления
        перестанут приходить, а склад поменять принадлежность к фракции, однако все подкрепления которые уже шли в
        сектор дойдут до него и продолжать работать, включая строительство если там будет строитель.</p>
    </div>
  </div>
</template>

<script>
export default {
  name: "Expedition"
}
</script>

<style scoped>

</style>
