<template>
  <div class="content_section">
    <h2 class="head">Фракционная война</h2>

    <div class="content_section">
      <div class="detailImg" :style="{
              backgroundImage: 'url(' + $parent.getUrlImg('fraction_war', 'png')+ ')',
              width: '270px',
              height: '300px',
              float: 'left',
              marginLeft: '10px',
              marginRight: '10px',
            }"/>

      <p>На спортных территориях постоянно идет война, каждый игрок автоматически принимает участия в ней как там
        оказывается.</p>

      <p>За участие в войне игроки повышают свой боевой ранг и зарабытвают очки фракций которые можно будет обменять на
        фракционные чертежи.</p>

      <p>Очки можно получить за:</p>
      <ul style="float: left">
        <li>Убийство игрока: % от нанесенного урона * 10 (при 100% урона 1 000 очков)</li>
        <li>Убийство за фракционного бота: % от нанесенного урона * 5 (при 100% урона 500 очков)</li>
        <li>Убийство бота АОП: % от нанесенного урона * 3 (при 100% урона 300 очков)</li>
        --
        <li>Содействие убийство игрока: % от нанесенного урона * 5 (при 100% урона 500 очков)</li>
        <li>Содействие убийство за фракционного бота: % от нанесенного урона * 2,5 (при 100% урона 250 очков)</li>
        <li>Содействие убийство бота АОП: % от нанесенного урона * 1,5 (при 100% урона 150 очков)</li>
        --
        <li>Уничтожение структур: 200 очков</li>
        --
        <li>Захват базы 1 "очко захвата" - 25 очков фракции</li>
        --
        <li>Захват сектора 1500 очков всем кто проявлял активность последние 5 минут в секторе.</li>
      </ul>

      <p>Очки за убийство и содействие начисляются так же в свободных землях.</p>
    </div>

    <h3 class="headSection">Маяки управления</h3>
    <div class="content_section">
      <p>Для контроля секторов фракции используют "Маяки управления". Они интегрируют всю инфросутркутуру базы и сектора
        в
        глобальную инфроструктуру фракции. Исключением являются столицы фракций, их нельзя захватить и им не нужен
        маяк.</p>
      <div class="detailImg" :style="{
              backgroundImage: 'url(' + $parent.getUrlImg('beacons', 'png')+ ')',
              width: '325px',
              height: '110px',
              marginLeft: 'calc(50% - 162px)'
            }"/>

    </div>

    <h3 class="headSection">Захват сектора</h3>
    <p>Для захвата необходимо:</p>
    <ul>
      <li class="imageLi" style="">

        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('beacon', 'png')+ ')',
            width: '150px',
            height: '150px',
            float: 'left',
            marginRight: '10px',
            }"/>

        <p>1. Уничтожить вражеский маяк управления.</p>
        <p>Вражеский маяк должен быть установлен около главной базы сектора, скорее всего вокруг него будут возведены
          турели, щиты и вражеские еденицы.</p>
      </li>

      <li class="imageLi" style="">

        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('beacon_2', 'png')+ ')',
            width: '150px',
            height: '150px',
            float: 'left',
            marginRight: '10px',
            }"/>

        <p>2. Закрепить влияние над территорией.</p>
        <p>Когда у базы нет маяка управления то база является нейтральной и перед установкой маяка необходимо зачистить
          и обезопасить прилежащую территорию. Для этого надо уничтожать всех врагов и находится в кругу захвата базы
          пока не заполнется шкала влияния.</p>
      </li>

      <li class="imageLi" style="">
        <p>3. Построить свой маяк</p>
        <p>Когда вы заполнили влияние то вы можете построить свой маяк управления базы, после успешной постройки база
          сразу станет ваша.</p>
        <p>Опционально: вы можете подождать пока приедет строительный бот и построит маяк сам, что бы не тратить свои
          ресурсы и чертежи, однако он может и не доехать т.к. его убьют (или залагает.)</p>
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: "FractionWar"
}
</script>

<style scoped>

</style>
