<template>
  <div>
    <h3 class="headSection" id="install_and_dismantling">Установка и демонтаж</h3>

    <p>Устанавливать большинство сооружения нельзя около телепортов и дорог, кроме добывающией строений (их можно
      устанавливать только на залежи полезных ископаемых) и фракционного маяка (его можно установить только около
      незахваченой базы с влиянием фракции 100%)</p>

    <p>При наличие необходимых компонентов процест установки сооружения выглядит так:</p>
    <ul>
      <li>Выбераете на "панеле снаряжения" инженерный модуль.</li>
      <li>Выбераете режим модуля "строительство". Это откроект меню строительства, где будут показаны доступные
        сооружения.
      </li>
      <li>Выбераете в меню сооружение которые хотите установить.</li>
      <li>Выбераете место куда хотите установить сооружение.</li>
      <li>После нажатия левой клавиши из трюма пропадет чертеж и сооружение установится на карте с 0% завершения.</li>
      <li>Инженерным модулем фокусите строение и нажимаете левую кнопку мыши, за каждую итерацию будет завершатся
        какойто % строительства и отниматся ресурсы сопостовимые этому проценту.
      </li>
    </ul>
    <p>Для демонтажа:</p>
    <ul>
      <li>Выбераете режим модуля "демонтаж"</li>
      <li>После нажатия левой клавиши на обьект за каждую итерацию будет уменьшатся параметр завершенности на
        % и возвращатся ресурсы сопостовимые этому проценту.
      </li>
      <li>Сооружение которое уже было полностью построено еще может функционировать при 50% завершенности.</li>
      <li>Когда % завершенности доходит до 0% обьект пропадает а в трюм возвращается чертеж.</li>
    </ul>
    <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('build_4', 'gif')+ ')',
            width: '335px',
            height: '317px',
            marginLeft: 'calc(50% - 167px)',
            }"/>
  </div>
</template>

<script>
export default {
  name: "InstallAndDismantling"
}
</script>

<style scoped>

</style>
