<template>
  <div class="content_section">
    <h2 class="head">Система правосудия</h2>

    <p>В безопасных и боевых секторах есть правила, нарушая которые игрок меняет свой статус опасности. </p>
    <p>Всего есть 2 статуса опасности:</p>
    <ul>
      <li class="imageLi">
        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('pvp', 'png')+ ')',
            width: '200px',
            height: '185px',
            float: 'left',
            marginRight: '10px',
            }"/>

        <p>Режим "PVP" - весит на игроке 30 секун, пока игрок находится в этом статусе его могут атаковать и убивать
          другие игроки но они сами входят в режим "PVP".</p>
      </li>
      <li class="imageLi">
        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('pk', 'png')+ ')',
            width: '200px',
            height: '185px',
            float: 'left',
            marginRight: '10px',
            }"/>
        <p>Режим "PK" - весит на игроке 5 минут, этого игрока могут свободно атаковать все без каких либо
          штрафов.</p>
      </li>
    </ul>

    <p>Режимы остаются весесь даже после смерти.</p>

    <p>Так же поведение системы правосудия немного различаются в разных типах секторов.</p>
    <h3 class="headSection">Безопасные сектора:</h3>
    <ul>
      <li>За любой урон по игроку или его имуществу введет вас в режим "PVP"</li>
      <li>За убийство или уничтожение имущество получаете режим "PK"</li>
    </ul>

    <div class="content_section">
      <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('guard_1', 'gif')+ ')',
            width: '320px',
            height: '185px',
            float: 'left',
            marginRight: '10px',
            }"/>

      <p>Если игрок в режиме "PVP" находится в пределах владения базы и у нее есть "Стражи" то игрок будет замарожен
        пока не спадет этот режим. В режиме замарозки игрок неможет двигатся и использовать снаряжение, но на него
        вешается непробиваемый щит.</p>

      <p>При проявление агресии в нпс они откроют ответный огонь а так же позовут подмогу.</p>

      <p>Стражи, другие боты и турели атакуют игроков в режиме "PK".</p>

      <p>Несмотря на все меры соблюдения безопасности в секторе, гарантировать ее вам не кто не может.</p>
    </div>

    <div class="content_section">
      <h3 class="headSection">Боевые сектора:</h3>
      <ul>
        <li>За атаку маяка своей базы игрок получает режим "PVP".</li>
        <li>За уничтожение маяка своей базы игрок получает режим "PK".</li>
        <li>За убийство игрока своей фракции или его имущества включается режим "PVP".</li>
        <li>За игроков и структур других фракций получить штрафы нельзя.</li>
      </ul>
    </div>

    <div class="content_section">
      <h3 class="headSection">Свободные сектора:</h3>
      <ul>
        <li>В свободных секторах система правосудия полностью отключена.</li>
        <li>Боты других фракций а так же боты своей фракции но которые имеют ненависть к вам будут вас атаковать.</li>
      </ul>
    </div>

    <h3 class="headSection">Маяки бедствия</h3>
    <p>При смерти транспорта срабатывает аварийный маяк, он испускает широковещательный сигнал который видят все боты и
      игроки на мини карте. Боты охраники сразу же идут на разведку территории по этим координатам.</p>
    <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('battle_3', 'gif')+ ')',
            width: '183px',
            height: '200px',
            marginLeft: 'calc(50% - 92px)',
            }"/>

    <div class="content_section">
      <h3 class="headSection">Таймер выхода из игры</h3>
      <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('exit_timer', 'png')+ ')',
            width: '230px',
            height: '100px',
            float: 'left',
            marginRight: '10px',
            }"/>

      <p>Таймер не позволяйет выйти из игры спустя какое то время после получения урона или получения статуса опасности.
        Если игрок отключится его транспорт останется в игре еще столько времени сколько указано на иконке.</p>

      <ul style="float: left">
        <li> Получение урона от бота активирует таймер на 60сек</li>
        <li> Получение урона от игрока активирует таймер на 120сек</li>
        <li> Получение статуса опасности "PVP" на 30 секунд</li>
        <li> Получение статуса опасности "PK" на 5 минут</li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  name: "Law"
}
</script>

<style scoped>

</style>
