<template>
  <div>
    <h2 class="head" id="bodies">Переработка ресурсов</h2>
    <p>Переработчик ресурсов доступен на базе переработки, в нем можно переработать полезные ископаемые на сырье или
      разобрать уже готовые предметы.</p>

    <p>У каждого полезного ископаемого есть базовое кол-во сырья на которое его можно разложить, но на это количество
      влиют навыки
      переработки игрока и налог базы. Налог взымается только из ресурсов на предметы налог не берется.</p>

    <p>Алгоритм переработка работает так:</p>
    <ul>
      <li>Необходимые элементы кладутся в переработчик</li>
      <li>Высчитывается максимальное кол-во ресурсов и отнимается % потерь при пераработке</li>
      <li>Из того что осталось база забирает налог на поддержание своих систем и постройки нпс</li>
      <li>Оставшееся кол-во ресурсов получает игрок</li>
    </ul>

    <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('processing_1', 'jpg')+ ')',
            width: '660px',
            height: '305px',
            marginLeft: 'calc(50% - 330px)',
            }"/>

    <p>За каждые 4 еденицы переработаного полезного ископаемого игрок получает 1 поинт навыка переработки.</p>
  </div>
</template>

<script>
export default {
  name: "Processing"
}
</script>

<style scoped>

</style>
