<template>
  <div class="content_section">
    <h2 class="head">Сектор</h2>
    <p>Сектор - это безопасный участок планеты где передвигаются транспорты, воюют и добывают ресурсы.
      Большенство секторов имеют внутри себя инфраструктуру из баз, заводов и тд.</p>

    <p>Сектора делятся на 3 основных типа:</p>
    <ul>
      <li>Безопасные сектора - тут запрещены битвы системой правосудия, могут обитать стражи до 3х штук.</li>
      <li>Боевые сектора - это спортные территории на который идет война между фракциями</li>
      <li>Свободная территория - в этих секторах нету баз и много опасносней, но зато тут нетронутые ресурсы и
        различные аномалии
      </li>
    </ul>

    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('world_1', 'png')+ ')',
        width: '524px',
        height: '561px',
        marginLeft: 'calc(50% - 262px)',
        }"/>

    <h3 class="headSection">Безопасный сектор</h3>
    <ul>
      <li>В этих секторах запрещены военные действия даже между фракциями и работает система правосудия.</li>
      <li>За порядком могут следить "Стражи" которые практически не уязвимы для транпортов.</li>
      <li>Базы обслуживают всех игроков не зависимо от фракции, включая выдачу заданий.</li>
      <li>Активность АПД снижена до минимума и их быстро устраняют стражи и боты защитники.</li>
      <li>Малое количество ресурсов, отсутсвуют редкие ресурсы и нефть, так же приходится конкурировать с нпс.</li>
      <li>Максимальное налогооблажение на производство.</li>
      <li>Малое кол-во аномалий с стандартным лутом.</li>
    </ul>

    <h3 class="headSection">Боевые сектора</h3>
    <ul>
      <li>Свободное пвп с игроками других фракций.</li>
      <li>За убийства врагов и захват секторов игрок получает очки фракци, их можно обменять в фракционном отделе на
        базе.
      </li>
      <li>Ослабленная система правосудия, работает только на игроков своей фракции, нет стражей.</li>
      <li>Малое количество ресурсов, есть редкие минералы но отсутсвует нефть.</li>
      <li>Среднее кол-во аномалий с редким лутом.</li>
      <li>Средняя активность АПД</li>
    </ul>

    <h3 class="headSection">Свободная территория</h3>
    <ul>
      <li>Анархия (все что происходит тут остается тут).</li>
      <li>Много ресурсов, есть редкие и нефть.</li>
      <li>Высокая активность АПД включая тяжелые транпорты.</li>
      <li>Отсутвуют базы и инфроструктура.</li>
      <li>НПС других фракций будут к вам враждебны.</li>
      <li>Много аномалий с очень редким лутом</li>
    </ul>
  </div>
</template>

<script>
export default {
  name: "Sector"
}
</script>

<style scoped>

</style>
