<template>
  <div class="content_section">
    <h3 class="headSection" id="weapons">Оружие</h3>
    <p>Оружие состоит из 2х компонентов, непосредственно оружие и боеприпас которым оно будет стрелять. Без боеприпаса
      оружие стрелять не может.</p>
    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('wiki_weapon_1', 'png')+ ')',
        width: '595px',
        height: '342px',
        marginLeft: 'calc(50% - 294px)',
        }"/>

    <p>Оружие определяет такие характиристики: </p>
    <ul>
      <li><span class="headSection">Размер оружия</span> - стандар размера оружия, по этому параметру определяется можно
        ли его снарядить в корпус.
      </li>
      <li><span class="headSection">Тип оружия</span> - определяет тип оружия.</li>
      <li><span class="headSection">Скорость поворота</span> - скорость поворота оружия гр/сек</li>
      <li><span class="headSection">Модификатор урона</span> - множитель урона боеприпаса, (урон боеприпаса *
        множитель)
      </li>
      <li><span class="headSection">Доступные углы атаки</span> - доступные вертикальные углы атаки, для балистического
        оружия это напрямую определяет на дальность полета и скорость боеприпаса. Для лазерного оружия это означает
        доступность или нет стрелять в низ или в вверх.
      </li>
      <li><span class="headSection">Влияние на скорость пули</span> - влияние на скорость полета боеприпаса. (скорость
        боеп. + влияение)
      </li>
      <li><span class="headSection">Дальность стрельбы</span> - для лазерного и ракетного оружия определяет дальность
        оружия, для огнестрельного дальность определяет за счет углов и скорости пули и летит до тех пор пока не упадет
        на землю, то есть на неровной поверхности дальность может быть разной.
      </li>
      <li><span class="headSection">Очередь</span> - кол-во пуль выпускаемых за 1 выстрел.</li>
      <li><span class="headSection">Скорострельность</span> - сколько выстрелов может совершить оружие, без учета
        перезарядки.
      </li>
      <li><span class="headSection">Боезапас</span> - макс. кол-во боеприпаса в магазине.</li>
      <li><span class="headSection">Время перезарядки</span> - время перезарядки магазина.</li>
      <li><span class="headSection">Необходимо энергии</span> - сколько будет зарезервировано энергии в корпусе.</li>
      <li><span class="headSection">Занимаемый объем</span> - сколько места занимает 1 еденица в трюме.</li>
    </ul>

    <p>Боеприпас определяет такие характиристики: </p>
    <ul>
      <li><span class="headSection">Размер оружия</span> - стандар размера оружия, к которому подойдет этот боеприпас.
      </li>
      <li><span class="headSection">Тип оружия</span> тип оружия к которому подойдет этот боеприпас</li>
      <li><span class="headSection">Тип атаки</span> - определяет вид урона который будет наносить боеприпас
        (кинетический, термо, взрывной)
      </li>
      <li><span class="headSection">Урон</span> - мин. и макс. базовый урон боприпаса.</li>
      <li><span class="headSection">Радиус поражения</span> - дальность после разрыва боеприпаса от которого
        все получат урон, чем дальше от эпицентра взрыва тем меньше урон, на самой гранце будет 1% урона, в самом центре
        100%.
      </li>
      <li><span class="headSection">Скорость полета пули</span> - скорость с которой летит пуля из ствола оружия.</li>
      <li><span class="headSection">Управляемость</span> - когда снаряд управляемыемый им можно управлять после выстрела
        с помощью мыши.
      </li>
      <li><span class="headSection">Занимаемый объем</span> - сколько места занимает 1 еденица боеприпаса в трюме.</li>
    </ul>

    <br>
    <h3 class="headSection">Типы оружия: </h3>
    <p>Оружие в игре делится на 3 основных типа:</p>

    <ul class="content_list" style="margin-top: 5px">
      <li><span class="headSection" style="font-size: 10px">Ракетное вооружение</span>

        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('weapon_2', 'png')+ ')',
            width: '380px',
            height: '180px',
            marginLeft: 'calc(50% - 190px)',
            }"/>

        <p>Ракетное вооружение, отличается фиксированной скорость полета пули, высоким уроном и точностью (для
          некоторый ракет управляемостью), однако против него можно применить ПРО который будет сбивать их на подлете,
          а скорость ракет не отличается быстротой.</p>
        <p>Ракеты имеют также фиксированную дистанцию полета после чего они взрываются даже если не столкнулись с
          целью.</p>
        <p>Еще одной особенностью ракет является то что летящие ракеты отображаются на радаре как летящие объекты.</p>
      </li>

      <li><span class="headSection" style="font-size: 10px">Лазерное вооружение</span>

        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('weapon_3', 'png')+ ')',
            width: '380px',
            height: '180px',
            marginLeft: 'calc(50% - 190px)',
            }"/>

        <p>Лазерное оружие отличается мгновенной скоростью поражения цели, но стрелять "навесом" из него не
          выйдет.</p>
        <p>Имеет фиксированную дальность поражения.</p>
      </li>

      <li><span class="headSection" style="font-size: 10px">Огнестрельное вооружение</span>

        <div class="detailImg" :style="{
            backgroundImage: 'url(' + $parent.getUrlImg('weapon_4', 'png')+ ')',
            width: '380px',
            height: '200px',
            marginLeft: 'calc(50% - 190px)',
            }"/>

        <p>Огнестрельное оружие имеет баллистическую траекторию из за чего обладает не фиксированной дальностью атаки и
          скоростью полета пули можно стрелять навесом стреляя через препятствия.</p>
        <p>Боеприпасы огнестрельного оружия имеют начальную скорость но само оружие может влиять на нее, так же скорость
          зависит от угла атаки. Дальность атаки рассчитывается из параметров оружия и боеприпаса.</p>
      </li>
    </ul>

    <br>
    <h3 class="headSection">Навыки и штраф: </h3>
    <p>Навык владения боеприпасом определяет по его размеру и типу. Если использовать боеприпас на который нет допуска
      по навыку то минимальный урон боеприпаса становится 1.</p>
    <p>Навык владения боеприпасом повышается когда этим боеприпасом вы попадаете в цель и наносите урон.</p>

    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('wiki_weapon_2', 'png')+ ')',
        width: '368px',
        height: '348px',
        marginLeft: 'calc(50% - 184px)',
    }"/>

    <p>Навык владения оружием определяет по его размеру и типу. Если использовать оружие на который нет допуска
      по навыку то падает точность и поворот оружия медленнее и происходит рывками.</p>
    <p>Навык владения оружием повышается за сам факт выстрела этим оружием.</p>

    <div class="detailImg" :style="{
        backgroundImage: 'url(' + $parent.getUrlImg('wiki_weapon_3', 'png')+ ')',
        width: '368px',
        height: '372px',
        marginLeft: 'calc(50% - 184px)',
    }"/>

  </div>
</template>

<script>
export default {
  name: "Weapons"
}
</script>

<style scoped>

</style>
